{
  "format": "layers-model",
  "generatedBy": "keras v2.11.0",
  "convertedBy": "TensorFlow.js Converter v3.15.0",
  "modelTopology": {
    "keras_version": "2.11.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_2",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 512, 512, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_2"
            }
          },
          {
            "class_name": "Sequential",
            "config": {
              "name": "sequential",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [null, 512, 512, 3],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "random_flip_input"
                  }
                },
                {
                  "class_name": "RandomFlip",
                  "config": {
                    "name": "random_flip",
                    "trainable": true,
                    "dtype": "float32",
                    "mode": "horizontal"
                  }
                }
              ]
            }
          },
          {
            "class_name": "ConvBlock",
            "config": {
              "name": "conv_block_9",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": 3
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_5",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "ConvBlock",
            "config": {
              "name": "conv_block_10",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": 3
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_6",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "ConvBlock",
            "config": {
              "name": "conv_block_11",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": 3
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_7",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_3",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "ConvBlock",
            "config": {
              "name": "conv_block_12",
              "trainable": true,
              "dtype": "float32",
              "filters": 256,
              "kernel_size": 3
            }
          },
          {
            "class_name": "AveragePooling2D",
            "config": {
              "name": "average_pooling2d_3",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_4",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "ConvBlock",
            "config": {
              "name": "conv_block_13",
              "trainable": true,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": 3
            }
          },
          {
            "class_name": "ConvBlock",
            "config": {
              "name": "conv_block_14",
              "trainable": true,
              "dtype": "float32",
              "filters": 512,
              "kernel_size": 3
            }
          },
          {
            "class_name": "AveragePooling2D",
            "config": {
              "name": "average_pooling2d_4",
              "trainable": true,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_5",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 256,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": {
        "class_name": "BinaryCrossentropy",
        "config": {
          "reduction": "auto",
          "name": "binary_crossentropy",
          "from_logits": false,
          "label_smoothing": 0.0,
          "axis": -1
        }
      },
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "binary_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>Adam",
        "config": {
          "name": "Adam",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": true,
          "is_legacy_optimizer": false,
          "learning_rate": 0.0010000000474974513,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of25.bin",
        "group1-shard2of25.bin",
        "group1-shard3of25.bin",
        "group1-shard4of25.bin",
        "group1-shard5of25.bin",
        "group1-shard6of25.bin",
        "group1-shard7of25.bin",
        "group1-shard8of25.bin",
        "group1-shard9of25.bin",
        "group1-shard10of25.bin",
        "group1-shard11of25.bin",
        "group1-shard12of25.bin",
        "group1-shard13of25.bin",
        "group1-shard14of25.bin",
        "group1-shard15of25.bin",
        "group1-shard16of25.bin",
        "group1-shard17of25.bin",
        "group1-shard18of25.bin",
        "group1-shard19of25.bin",
        "group1-shard20of25.bin",
        "group1-shard21of25.bin",
        "group1-shard22of25.bin",
        "group1-shard23of25.bin",
        "group1-shard24of25.bin",
        "group1-shard25of25.bin"
      ],
      "weights": [
        {
          "name": "conv_block_10/conv2d_10/kernel",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "conv_block_10/conv2d_10/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv_block_10/batch_normalization_10/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv_block_10/batch_normalization_10/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv_block_10/batch_normalization_10/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv_block_10/batch_normalization_10/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv_block_11/conv2d_11/kernel",
          "shape": [3, 3, 64, 128],
          "dtype": "float32"
        },
        {
          "name": "conv_block_11/conv2d_11/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv_block_11/batch_normalization_11/gamma",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv_block_11/batch_normalization_11/beta",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv_block_11/batch_normalization_11/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv_block_11/batch_normalization_11/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv_block_12/conv2d_12/kernel",
          "shape": [3, 3, 128, 256],
          "dtype": "float32"
        },
        {
          "name": "conv_block_12/conv2d_12/bias",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "conv_block_12/batch_normalization_12/gamma",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "conv_block_12/batch_normalization_12/beta",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "conv_block_12/batch_normalization_12/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "conv_block_12/batch_normalization_12/moving_variance",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "conv_block_13/conv2d_13/kernel",
          "shape": [3, 3, 256, 512],
          "dtype": "float32"
        },
        {
          "name": "conv_block_13/conv2d_13/bias",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "conv_block_13/batch_normalization_13/gamma",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "conv_block_13/batch_normalization_13/beta",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "conv_block_13/batch_normalization_13/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "conv_block_13/batch_normalization_13/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "conv_block_14/conv2d_14/kernel",
          "shape": [3, 3, 512, 512],
          "dtype": "float32"
        },
        {
          "name": "conv_block_14/conv2d_14/bias",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "conv_block_14/batch_normalization_14/gamma",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "conv_block_14/batch_normalization_14/beta",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "conv_block_14/batch_normalization_14/moving_mean",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "conv_block_14/batch_normalization_14/moving_variance",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "conv_block_9/conv2d_9/kernel",
          "shape": [3, 3, 3, 32],
          "dtype": "float32"
        },
        {
          "name": "conv_block_9/conv2d_9/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "conv_block_9/batch_normalization_9/gamma",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "conv_block_9/batch_normalization_9/beta",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "conv_block_9/batch_normalization_9/moving_mean",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "conv_block_9/batch_normalization_9/moving_variance",
          "shape": [32],
          "dtype": "float32"
        },
        { "name": "dense_2/kernel", "shape": [86528, 256], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [256], "dtype": "float32" },
        { "name": "dense_3/kernel", "shape": [256, 1], "dtype": "float32" },
        { "name": "dense_3/bias", "shape": [1], "dtype": "float32" }
      ]
    }
  ]
}
